/*
 * << , >>
 * 쉬프트연산자 => 비트이동 연산자라고도 한다.
 * <<:비트를 왼쪽으로 이동==>공백에 0을 채운다. ==>산술
 *    =======x<<y ==> x*2^y
 *       10<<2
 *    1010   =>10
 *  101000  =>40
 *  
 *  >>: 오른쪽이동==> 비트를 제거 
 *     =======>x>>y ==>x/2^y
 *           ==>10>>2 ==>  10/2^2 ==> 10/4 ==> 2
 *     10>>2
 *   1010 =>10
 *     10 =>2
 *     
 *     
 *     8<<3	
 *     1000
 *   100000 ==> 64
 *   
 *   
 */
public class 이향연산자_쉬프트연산자 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
